package com.example.demo.core;

/**
 * Имитация данных, получаемых из БД, список регионов с кодами
 */
public enum Region {
    AD(new int[]{1, 101}, "Республика Адыгея (Адыгея)"),
    AL(new int[]{4}, "Республика Алтай"),
    BA(new int[]{2, 102, 702}, "Республика Башкортостан"),
    BU(new int[]{3, 103}, "Республика Бурятия"),
    DA(new int[]{5}, "Республика Дагестан"),
    DNR(new int[]{80, 180}, "Донецкая Народная Республика"),
    IN(new int[]{6}, "Республика Ингушетия"),
    KB(new int[]{7}, "Кабардино-Балкарская Республика"),
    KL(new int[]{8}, "Республика Калмыкия"),
    KC(new int[]{9, 109}, "Карачаево-Черкесская Республика"),
    KR(new int[]{10}, "Республика Карелия"),
    KO(new int[]{11, 111}, "Республика Коми"),
    KRYM(new int[]{82}, "Республика Крым"),
    LNR(new int[]{81, 181}, "Луганская Народная Республика"),
    ME(new int[]{12}, "Республика Марий Эл"),
    MO(new int[]{13, 113}, "Республика Мордовия"),
    SA(new int[]{14}, "Республика Саха (Якутия)"),
    SE(new int[]{15}, "Республика Северная Осетия — Алания"),
    TA(new int[]{16, 116, 716}, "Республика Татарстан (Татарстан)"),
    TY(new int[]{17}, "Республика Тыва"),
    UD(new int[]{18, 118}, "Удмуртская Республика"),
    KK(new int[]{19}, "Республика Хакасия"),
    CE(new int[]{20, 95}, "Чеченская Республика"),
    CU(new int[]{21, 121}, "Чувашская Республика —  Чувашия"),
    ALT(new int[]{22, 122}, "Алтайский край"),
    ZAB(new int[]{75, 80}, "Забайкальский край"),
    KAM(new int[]{41}, "Камчатский край"),
    KDA(new int[]{23, 93, 123, 193}, "Краснодарский край"),
    KYA(new int[]{24, 84, 88, 124}, "Красноярский край"),
    PER(new int[]{59, 81, 159}, "Пермский край"),
    PRI(new int[]{25, 125}, "Приморский край"),
    STA(new int[]{26, 126}, "Ставропольский край"),
    KHA(new int[]{27}, "Хабаровский край"),
    AMU(new int[]{28}, "Амурская область"),
    ARK(new int[]{29}, "Архангельская область"),
    AST(new int[]{30, 130}, "Астраханская область"),
    BEL(new int[]{31}, "Белгородская область"),
    BRY(new int[]{32}, "Брянская область"),
    VLA(new int[]{33}, "Владимирская область"),
    VGG(new int[]{34, 134}, "Волгоградская область"),
    VLG(new int[]{35}, "Вологодская область"),
    VOR(new int[]{36, 136}, "Воронежская область"),
    ZAP(new int[]{85}, "Запорожская область"),
    IVA(new int[]{37}, "Ивановская область"),
    IRK(new int[]{38, 85, 138}, "Иркутская область"),
    KGD(new int[]{39, 91}, "Калининградская область"),
    KLU(new int[]{40}, "Калужская область"),
    KEM(new int[]{42, 142}, "Кемеровская область"),
    KIR(new int[]{43}, "Кировская область"),
    KOS(new int[]{44}, "Костромская область"),
    KGN(new int[]{45}, "Курганская область"),
    KRS(new int[]{46}, "Курская область"),
    LEN(new int[]{47, 147}, "Ленинградская область"),
    LIP(new int[]{48}, "Липецкая область"),
    MAG(new int[]{49}, "Магаданская область"),
    MOS(new int[]{50, 90, 150, 190, 750, 790}, "Московская область"),
    MUR(new int[]{51}, "Мурманская область"),
    NIZ(new int[]{52, 152, 752}, "Нижегородская область"),
    NGR(new int[]{53}, "Новгородская область"),
    NVS(new int[]{54, 154, 754}, "Новосибирская область"),
    OMS(new int[]{55, 155}, "Омская область"),
    ORE(new int[]{56, 156}, "Оренбургская область"),
    ORL(new int[]{57}, "Орловская область"),
    PNZ(new int[]{58, 158}, "Пензенская область"),
    PSK(new int[]{60}, "Псковская область"),
    ROS(new int[]{61, 161, 761}, "Ростовская область"),
    RYA(new int[]{62}, "Рязанская область"),
    SAM(new int[]{63, 163, 763}, "Самарская область"),
    SAR(new int[]{64, 164}, "Саратовская область"),
    SAK(new int[]{65}, "Сахалинская область"),
    SVE(new int[]{66, 96, 196}, "Свердловская область"),
    SMO(new int[]{67}, "Смоленская область"),
    TAM(new int[]{68}, "Тамбовская область"),
    TVE(new int[]{69}, "Тверская область"),
    TOM(new int[]{70}, "Томская область"),
    TUL(new int[]{71}, "Тульская область"),
    TYU(new int[]{72,172}, "Тюменская область"),
    ULY(new int[]{73,173}, "Ульяновская область"),
    KHE(new int[]{84}, "Херсонская область"),
    CHE(new int[]{74, 174, 774}, "Челябинская область"),
    YAR(new int[]{76}, "Ярославская область"),
    MOW(new int[]{77, 97, 99, 177, 197, 199, 777, 797, 799, 977}, "Москва"),
    SPE(new int[]{78, 98, 178, 198}, "Санкт-Петербург"),
    SEV(new int[]{92}, "Севастополь"),
    YEV(new int[]{79}, "Еврейская автономная область"),
    NEN(new int[]{83}, "Ненецкий автономный округ"),
    KHM(new int[]{86,186}, "Ханты-Мансийский автономный округ — Югра"),
    CHU(new int[]{87}, "Чукотский автономный округ"),
    YAN(new int[]{89}, "Ямало-Ненецкий автономный округ"),
    BAY(new int[]{94}, "Территории, находящиеся за пределами РФ и обслуживаемые Управлением режимных объектов МВД России, Байконур");

    int[] codes;
    String nameFull;

    Region(int[] codes, String nameFull) {
        this.codes = codes;
        this.nameFull = nameFull;
    }

    public int[] getCodes() {
        return codes;
    }

    public String getNameFull() {
        return nameFull;
    }

    public static Region valOf(Integer code) {
        if (code != null && code > 0) {
            for (Region region : Region.values()) {
                for (int i : region.getCodes()) {
                    if (i == code) {
                        return region;
                    }
                }
            }
        }
        return null;
    }
}
